<?php require_once("partials/boilerplate.php"); ?>
<link rel="stylesheet" href="../public/styles/home.css">
</head>

<body style="padding-top: 9em;">
    <?php
    require_once("partials/navbar.php");
    require_once("../utils/flash_messages.php");
    ?>
    <main>
        <section id="aboutUs" class="container">
            <h1 class="text-center mb-4">Σχετικά με μας</h1>
            <p>Καλώς ήρθατε στο HomeIQ!

                Το HomeIQ ιδρύθηκε το 2024 με στόχο να αναδείξει την ελληνική αγορά στον κόσμο των προϊόντων έξυπνου σπιτιού.
                Εδώ στο HomeIQ, αφοσιωνόμαστε στην παροχή υψηλής ποιότητας προϊόντων έξυπνου σπιτιού που συνδυάζουν την πρωτοποριακή
                τεχνολογία με την άνεση και την απλότητα της χρήσης.
            </p>
            <p>
                Ξεκινήσαμε το ταξίδι μας με την αγάπη μας για την τεχνολογία και το πάθος μας για το έξυπνο σπίτι.
                Μέσα από συνεχή έρευνα και ανάπτυξη, δημιουργούμε προϊόντα που προάγουν την έξυπνη και βελτιωμένη καθημερινότητα.
            </p>
            <p>
                Στο HomeIQ, πιστεύουμε στη δύναμη της καινοτομίας και της δημιουργικότητας για να δημιουργήσουμε ένα καλύτερο αύριο για τους πελάτες μας.
                Είμαστε δίπλα σας κάθε βήμα του δρόμου για να σας προσφέρουμε την καλύτερη δυνατή εμπειρία με τα προϊόντα μας.

                Σας ευχαριστούμε που επιλέξατε το HomeIQ για τις ανάγκες σας σε έξυπνα προϊόντα.
                Ελπίζουμε ότι θα απολαύσετε τις αγορές σας και ότι θα μοιραστείτε μαζί μας την εμπειρία σας.
            </p>
        </section>

    </main>
</body>
<?php require_once("partials/footer.php"); ?>