<?php require_once("../partials/boilerplate.php"); ?>
<link rel="stylesheet" href="../../public/styles/product_category.css">
<link rel="stylesheet" href="../../public/styles/productLink.css">
</head>

<body style="margin-top: 9em;">
    <?php require_once "../partials/navbar.php";
    // require("../../models/product.php");
    if (isset($_GET["category"])) {
        $category = $_GET["category"];
        $pr = new Product();
        $list = $pr->getProductSubcategories($category);
        $source = $controllersPath;
        if ($category == "Φωτισμός") {
            $img = "https://images.unsplash.com/photo-1618403323851-ac3d38029495?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D";
            $descr = "Η αγορά ταινιών LED και έξυπνων λαμπτήρων ανοίγει τον δρόμο προς ένα πιο φιλικό προς το περιβάλλον και λειτουργικό σπίτι. 
            Οι ταινίες LED προσφέρουν ένα ευέλικτο και εντυπωσιακό τρόπο να διακοσμήσετε τον εσωτερικό ή ακόμη και τον εξωτερικό χώρο σας, 
            δημιουργώντας ένα μοναδικό περιβάλλον. Επιπλέον, οι έξυπνοι λαμπτήρες σας δίνουν τη δυνατότητα να ρυθμίσετε το φωτισμό σας ακριβώς όπως 
            επιθυμείτε, είτε πρόκειται για ατμοσφαιρικό φωτισμό για μια ρομαντική βραδιά είτε για εντατικό φως για το διάβασμα. Με τη χρήση της 
            τεχνολογίας LED, μπορείτε επίσης να εξοικονομήσετε ενέργεια και να μειώσετε το κόστος των ενεργειακών σας λογαριασμών. 
            Επομένως, επιλέγοντας ταινίες LED και έξυπνους λαμπτήρες, επιλέγετε πρωτοποριακή τεχνολογία και λύσεις φωτισμού που εξυπηρετούν τις 
            ανάγκες σας ενώ ταυτόχρονα συμβάλλουν στην προστασία του περιβάλλοντος και την εξοικονόμηση ενέργειας.";
        } else if ($category == "Πρίζες") {
            $img = "https://images.unsplash.com/photo-1630314845863-8713669311cf?q=80&w=1374&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D";
            $descr = "Επενδύοντας σε έξυπνες πρίζες, ανοίγετε τον δρόμο προς ένα πιο άνετο και ευέλικτο σπίτι. Με την τεχνολογία αυτή, 
            μπορείτε να αποκτήσετε πλήρη έλεγχο των συσκευών σας, από οπουδήποτε κι αν βρίσκεστε, μέσω του κινητού σας τηλεφώνου. 
            Προσφέροντάς σας τη δυνατότητα προγραμματισμού και προσαρμογής της λειτουργίας τους, οι έξυπνες πρίζες κάνουν την καθημερινότητά σας πιο 
            απλή και ευέλικτη. Από το να ανάψετε τον καφέ σας πριν φτάσετε σπίτι μέχρι το να διαχειριστείτε το φωτισμό σας με μια φωνητική εντολή, 
            η τεχνολογία αυτή σας εξυπηρετεί με έναν τρόπο που προσαρμόζεται στις ανάγκες και τον τρόπο ζωής σας. Επιπλέον, η χρήση έξυπνων πριζών 
            σας επιτρέπει να ελέγχετε την κατανάλωση ενέργειας σας, βοηθώντας τόσο στην εξοικονόμηση χρημάτων όσο και στην προστασία του 
            περιβάλλοντος.";
        } else if ($category == "Ασφάλεια-Πρόσβαση") {
            $img = "https://mfs.ezvizlife.com/70c6637b825b2533292ded60869f0131.jpg?ver=4567492624";
            $descr = "
            Όταν πρόκειται για την ασφάλεια και την πρόσβαση στο σπίτι μας, η επιλογή προϊόντων έξυπνου σπιτιού είναι κρίσιμη για την ηρεμία και την ασφάλειά μας. 
            Τα έξυπνα συστήματα παρέχουν τη δυνατότητα παρακολούθησης του σπιτιού μας από απόσταση, επιτρέποντάς μας να ελέγχουμε την κατάσταση της πόρτας, 
            των παραθύρων και των κλειδαριών ανά πάσα στιγμή. Με τη δυνατότητα προσαρμογής πρότυπων ασφαλείας και την ειδοποίηση σε περίπτωση ανίχνευσης 
            κινδύνου, οι χρήστες αποκτούν την ασφάλεια ότι το σπίτι τους παραμένει προστατευμένο. Επιπλέον, η δυνατότητα πρόσβασης στο σπίτι μας μέσω 
            έξυπνων συστημάτων μπορεί να εξαλείψει την ανάγκη για κλειδιά και να προσφέρει ευκολία και άνεση κατά την είσοδο και την έξοδο από το σπίτι. 
            Με την απλότητα και την ευελιξία που παρέχουν τα έξυπνα συστήματα, η ασφάλεια και η πρόσβαση στο σπίτι μας γίνονται πιο εύκολες και 
            αποτελεσματικές.";
        } else if ($category == "Ψύξη-Θέρμανση") {
            $img = "https://images.unsplash.com/photo-1619140099965-06d74aaf51fa?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D";
            $descr = "Η επιλογή προϊόντων έξυπνου σπιτιού που αφορούν την ψύξη και θέρμανση σας προσφέρει πολλά οφέλη. 
            Με έξυπνα συστήματα που εξοικονομούν ενέργεια και παρέχουν άνεση,έχετε πλέον τον έλεγχο της θερμοκρασίας του σπιτιού σας 
            στα χέρια σας, ενώ παράλληλα απολαμβάνετε ένα περιβάλλον πιο άνετο και ευχάριστο. Με προσαρμοσμένες λύσεις που προσφέρουν προστασία και 
            ασφάλεια, η τεχνολογία έξυπνου σπιτιού καταφέρνει να διαμορφώσει την καθημερινότητά μας, προσφέροντας άνεση και ευκολία στην καθημερινότητά μας.";
        }
    }

    ?>
    <main>
        <section id="subcategories" class="container-fluid my-3">
            <div class="row my-3">
                <div class="col">
                    <img id="categoryPhoto" src=<?php echo $img ?> alt="Photo of the Product Category">
                </div>
            </div>
            <div class="row my-3 text-center">
                <h1 class="mb-3"><?php echo $category ?></h1>
                <p><?php echo $descr ?>
                </p>
            </div>
            <div class="row my-3">
                <?php foreach ($list as $l) : ?>

                    <div class=" col-sm-12 col-md-6 text-center">
                        <figure class="figure">
                            <a href="product_list.php?subcategory=<?php echo $l["_id"] ?>" class="product_img">
                                <img src="<?php echo $l["products"]["img"][0] ?>" class="figure-img img-fluid rounded w-50" alt="Subcategory Photo">
                            </a>
                            <figcaption class="figure-caption">
                                <a href="product_list.php?subcategory=<?php echo $l["_id"] ?>" class="product_link fs-5" style="color:black">
                                    <?php echo $l["_id"] ?>
                                </a>
                            </figcaption>
                        </figure>
                    </div>
                <?php endforeach; ?>
            </div>

        </section>
    </main>

    <?php require_once("../partials/footer.php"); ?>
</body>

</html>